1000ch.svgo
Compulim.indent4to2
dbaeumer.vscode-eslint
eg2.tslint
esbenp.prettier-vscode
funkyremi.vscode-google-translate
hollowtree.vue-snippets
jpoissonnier.vscode-styled-components
kenhowardpdx.vscode-gist
kumar-harsh.graphql-for-vscode
mauve.terraform
mhmadhamster.postcss-language
mohsen1.prettify-json
ms-vscode.atom-keybindings
ms-vscode.Go
ms-vsliveshare.vsliveshare
msjsdiag.debugger-for-chrome
octref.vetur
Orta.vscode-jest
ryanluker.vscode-coverage-gutters
shanoor.vscode-nginx
shinnn.stylelint
sysoev.language-stylus
timonwong.shellcheck
vscodevim.vim
whatwedo.twig
wmaurer.change-case
