tap "cloudfoundry/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "rcmdnk/file"
cask "java"
cask "xquartz"
brew "sqlite"
brew "python"
brew "awscli"
brew "bash-completion"
brew "colordiff"
brew "curl"
brew "dep"
brew "diff-pdf"
brew "docker"
brew "python@2"
brew "docker-compose"
brew "gibo"
brew "gifski"
brew "git"
brew "git-extras"
brew "git-secrets"
brew "gnupg"
brew "gnupg@1.4"
brew "goenv"
brew "hub"
brew "imagemagick"
brew "jq"
brew "kubernetes-helm"
brew "mas"
brew "mysql"
brew "nodenv"
brew "perl"
brew "php@7.1"
brew "pinentry-mac"
brew "postgresql"
brew "qt"
brew "rbenv"
brew "redis"
brew "sbt"
brew "scala"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tree"
brew "unar"
brew "unrar"
brew "vim"
brew "yarn", args: ["without-node"]
brew "youtube-dl"
brew "cloudfoundry/tap/cf-cli"
brew "heroku/brew/heroku"
brew "rcmdnk/file/brew-file"
cask "amazon-workspaces"
cask "android-platform-tools"
cask "android-studio"
cask "appcleaner"
cask "atom"
cask "avocode"
cask "bestres"
cask "betterzip"
cask "caffeine"
cask "clipy"
cask "docker"
cask "dropbox"
cask "expo-xde"
cask "figma"
cask "firefox"
cask "font-source-han-code-jp"
cask "gifcapture"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "keybase"
cask "nox-app-player"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "sequel-pro"
cask "skitch"
cask "spotify"
cask "the-unarchiver"
cask "torbrowser"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "zoomus"
cask "tunnelblick"
mas "1Password 7", id: 1333542190
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
