tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/versions"
tap "homebrew/binary"
tap "thoughtbot/formulae"

brew "zsh"
brew "zsh-completions"
brew "git"
brew "git-extras"
brew "gpg-agent"
brew "git-secrets"
brew "hub"
brew "tig"
brew "go"
brew "gibo"
brew "wget"
brew "yarn", args: ["without-node"]
brew "youtube-dl"
brew "curl"
brew "tree"
brew "openssl"
brew "the_silver_searcher"
brew "unrar"
brew "unar"
brew "awscli"
brew "colordiff"
brew "perl"
brew "rbenv"
brew "redis"
brew "ruby-build"
brew "heroku"
brew "direnv"
brew "highlight"
brew "pinentry-mac"
brew "postgresql"
brew "imagemagick"
brew "jq"
brew "mysql"
brew "sqlite"
brew "nodenv"
brew "python"
brew "sbt"
brew "vim"

tap "caskroom/versions"
tap "caskroom/fonts"
cask "google-chrome"
cask "google-chrome-canary"
cask "karabiner"
cask "avocode"
cask "google-japanese-ime"
cask "appcleaner"
cask "firefox"
cask "firefoxdeveloperedition"
cask "firefox-ja"
cask "dropbox"
cask "virtualbox"
cask "vagrant"
cask "atom"
cask "bettertouchtool"
cask "opera"
cask "flux"
cask "clipy"
cask "qlmarkdown"
cask "quicklook-json"
cask "betterzipql"
cask "qlstephen"
cask "qlcolorcode"
cask "font-source-code-pro"
cask "font-source-han-code-jp"
cask "java"
cask "sequel-pro"
cask "skitch"
cask "vlc"
cask "bestres"
cask "the-unarchiver"
cask "figma"
cask "caprine"
