
# tap repositories and their packages

tap 'homebrew/core'
brew 'adns'
brew 'apr'
brew 'apr-util'
brew 'aspell'
brew 'autoconf'
brew 'awscli'
brew 'bash-completion'
brew 'brotli'
brew 'c-ares'
brew 'cairo'
brew 'carthage'
brew 'circleci'
brew 'colordiff'
brew 'composer'
brew 'consul'
brew 'curl'
brew 'curl-openssl'
brew 'dep'
brew 'diff-pdf'
brew 'docker'
brew 'docker-compose'
brew 'fontconfig'
brew 'freetds'
brew 'freetype'
brew 'fribidi'
brew 'gawk'
brew 'gdbm'
brew 'gettext'
brew 'ghq'
brew 'gibo'
brew 'gifski'
brew 'git'
brew 'git-extras'
brew 'git-secrets'
brew 'glib'
brew 'gmp'
brew 'gnupg'
brew 'gnupg@1.4'
brew 'gnutls'
brew 'go'
brew 'goenv'
brew 'hadolint'
brew 'highlight'
brew 'hub'
brew 'icu4c'
brew 'imagemagick'
brew 'jansson'
brew 'jemalloc'
brew 'jpeg'
brew 'jq'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'libassuan'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libiconv'
brew 'libksba'
brew 'libpng'
brew 'libpq'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libyaml'
brew 'libzip'
brew 'little-cms2'
brew 'lua'
brew 'mas'
brew 'mcrypt'
brew 'mhash'
brew 'mongodb'
brew 'mpfr'
brew 'mysql'
brew 'nettle'
brew 'nghttp2'
brew 'node-build'
brew 'nodenv'
brew 'npth'
brew 'nspr'
brew 'nss'
brew 'oniguruma'
brew 'openjpeg'
brew 'openldap'
brew 'openssl'
brew 'p11-kit'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'php@7.1'
brew 'pinentry'
brew 'pinentry-mac'
brew 'pixman'
brew 'pkg-config'
brew 'poppler'
brew 'postgresql'
brew 'protobuf'
brew 'python'
brew 'python@2'
brew 'qt'
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'rlwrap'
brew 'ruby'
brew 'ruby-build'
brew 'sbt'
brew 'scala'
brew 'shellcheck'
brew 'sqlite'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tidy-html5'
brew 'tig'
brew 'translate-shell'
brew 'tree'
brew 'unar'
brew 'unixodbc'
brew 'unrar'
brew 'vim'
brew 'webp'
brew 'wxmac'
brew 'xz'
brew 'yarn', args: ['without-node']
brew 'youtube-dl'

tap 'homebrew/bundle'

tap 'homebrew/cask-fonts'
cask 'font-source-han-code-jp'

tap 'homebrew/services'

tap 'homebrew/cask'
cask 'amazon-workspaces'
cask 'android-platform-tools'
cask 'appcleaner'
cask 'avocode'
cask 'betterzip'
cask 'clipy'
cask 'dropbox'
cask 'figma'
cask 'gifcapture'
cask 'google-cloud-sdk'
cask 'java'
cask 'keybase'
cask 'nox-app-player'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'skitch'
cask 'the-unarchiver'
cask 'tunnelblick'
cask 'virtualbox'
cask 'vlc'
cask 'zoomus'

tap 'cloudfoundry/tap'
brew 'cf-cli'

tap 'heroku/brew'
brew 'heroku'
brew 'heroku-node'

tap 'rcmdnk/file'
brew 'brew-file'

# Other Cask applications
cask 'amethyst'
cask 'android-studio'
cask 'atom'
cask 'bestres'
cask 'caffeine'
cask 'docker'
cask 'expo-xde'
cask 'firefox'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'karabiner-elements'
cask 'minikube'
cask 'qlcolorcode'
cask 'qlstephen'
cask 'sequel-pro'
cask 'spotify'
cask 'torbrowser'
cask 'vagrant'
cask 'visual-studio-code'
cask 'xquartz'

# App Store applications
mas '1Password 7 (7.2.1)', id: 1333542190
mas 'GarageBand (10.3.2)', id: 682658836
mas 'HazeOver (1.8.1)', id: 430798174
mas 'iMovie (10.1.10)', id: 408981434
mas 'Keynote (8.3)', id: 409183694
mas 'Kindle (1.23.3)', id: 405399194
mas 'Noizio (1.6.2)', id: 928871589
mas 'Numbers (5.3)', id: 409203825
mas 'Pages (7.3)', id: 409201541
