tap "authzed/tap"
tap "cloudflare/cloudflare"
tap "dagger/tap"
tap "dlvhdr/formulae"
tap "go-task/tap"
tap "hashicorp/tap"
tap "manaflow-ai/cmux"
tap "mobile-dev-inc/tap"
tap "nodenv/nodenv"
tap "satococoa/tap"
tap "supabase/tap"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash Automated Testing System
brew "bats-core"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Container Signing
brew "cosign"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg", link: false
# Play, record, convert, and stream many audio and video codecs
brew "ffmpeg-full", link: true
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Google Suite CLI
brew "gogcli"
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full", link: true
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk@17"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@17", restart_service: :changed
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Python version management
brew "pyenv"
# Ruby version manager
brew "rbenv"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# OpenTofu / Terraform / Terragrunt / Terramate / Atmos version manager
brew "tenv"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# command-line client for managing SpiceDB
brew "authzed/tap/zed"
# Utility to export your existing Cloudflare resources as Terraform resources
brew "cloudflare/cloudflare/cf-terraforming"
# Dagger is an integrated platform to orchestrate the delivery of applications
brew "dagger/tap/dagger"
# Git diff pager based on delta but with a file tree, à la GitHub
brew "dlvhdr/formulae/diffnav"
# The easiest way to automate UI testing for your mobile app
brew "mobile-dev-inc/tap/maestro"
# Worktree Plus - Enhanced worktree management with automated setup and hooks
brew "satococoa/tap/wtp"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Tools for building Android applications
cask "android-studio"
# Memory training application
cask "anki"
# Agent orchestration platform
cask "antigravity"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Web browser focusing on privacy
cask "brave-browser"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Containerized environments for coding agents
cask "dagger/tap/container-use"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Launch builds and start simulators from your menu bar
cask "expo-orbit"
# Collaborative team software
cask "figma"
cask "font-fira-code-nerd-font"
cask "font-symbols-only-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# iOS Sideloading Companion
cask "iloader"
# Keyboard customiser
cask "karabiner-elements"
# End-to-end encryption software
cask "keybase"
# Clipboard manager
cask "maccy"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# NAS management application
cask "qfinder-pro"
# Control your tools with a few keystrokes
cask "raycast"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# Web browser
cask "safari-technology-preview"
# Web browser
cask "thebrowsercompany-dia"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
npm "@googleworkspace/cli"
npm "@playwright/cli"
npm "agent-browser"
npm "corepack"
npm "sentry"
npm "typescript-language-server"
npm "typescript"
